<template>
  <div class="detailClass1">
    <p>
      对于大中台来讲，现在并没有十分严格的定义，每个企业对其的理解都是不同的，有的在技术上使用大中台模式，有的在业务上使用大中台模式，有的将两者相结合。“大中台，小前台”的机制最初阿里提出的时候，主要应用于O2O线上线下协同、电商等场景，对于电商来说，市场环境是瞬息万变的，而前台是主要的一线业务，这时就需要一个强大的技术中台提供快速设计方法和系统性后端服务，去应对市场变化，灵活快速的做出应对策略。
    </p>
    <p>
      技术中台从技术角度出发，数据中台从业务数据角度出发，业务中台站在企业全局角度出发，从整体战略、业务支撑、连接用户、业务创新等方面进行统筹规划，由基础中台、技术中台、数据中台联合支撑来建设业务中台。
    </p>
    <p>
      本套中台案例基于真实工业界业务讲解，将多种经过工业界验证的成熟技术解决方案呈现给大家，本套课程拒绝枯燥的理论，全程代码实操，通过项目驱动的方式，让大家能够真实体验中台工业界开发过程，帮助大家建立中台思维，掌握本套课程全部内容你完全可以自主开发一套高性能高可用高扩展的中台系统。本套案例集后端+前台+测试+运维一体，全方位的带你熟悉全过程，祝大家早日迈向50万年薪。<br><br><br>
    </p>
    <p>
      本课程将带大家实现一个真实的工业界中台项目，该项目是基于真实的知名互联网企业项目讲解，<br />本课程将分为4个阶段：
    </p>
    <p>
      第一阶段：会实现中台系统的大部分核心服务，包括：会员中心，商品中心，交易中心，商家中心，支付中心，友凡商城等等。
      <br />第二阶段：进一步完善中台系统的核心服务以及优化，包括：营销中心，搜索中心，店铺中心，缓存优化，数据库优化等等。
      <br />第三阶段：进一步优化以及完善产品服务，包括：前台系统,中台系统，友凡商城
      友凡生鲜，友凡超市等等。
      <br />第四阶段：项目收尾阶段以及运维阶段，包括：压力测试,系统维护,系统部署,虚拟化方案,测试方案等等。
    </p>
    <div class="program">
        <Program></Program>
    </div>
  </div>
</template>

<script>
import Program from './../components/program'
export default {
  props: {},
  data() {
    return {};
  },
  methods: {},
  components: {
      Program,
  },
};
</script>

<style scoped lang="less">
.detailClass1 {
  font-size: 14px;
  color: rgb(78, 78, 78);
  p{
      line-height: 2;
  }
  .program{
      margin-top: 160px;
  }
}
</style>
